{
  "topicId": "exploratory_analysis",
  "quizQuestions": [
    {"id": "eda_quiz_1", "questionText": "Which of the following is NOT typically part of Exploratory Data Analysis?", "type": "MCQ", "options": ["Formal hypothesis testing with strict significance thresholds", "Checking for missing values and outliers", "Visualizing distributions of variables", "Examining correlations between variables"], "correctAnswer": "Formal hypothesis testing with strict significance thresholds", "explanation": "While EDA may involve informal hypothesis generation, formal hypothesis testing with predetermined significance thresholds is typically part of confirmatory data analysis that follows EDA, not part of the exploratory phase itself.", "difficulty": "EASY"},
    
    {"id": "eda_quiz_2", "questionText": "Which visualization would be most appropriate for examining the relationship between two continuous variables?", "type": "MCQ", "options": ["Scatter plot", "Bar chart", "Pie chart", "Stacked area chart"], "correctAnswer": "Scatter plot", "explanation": "Scatter plots are specifically designed to show relationships between two continuous variables by plotting individual data points, allowing patterns, correlations, clusters, and outliers to be easily identified.", "difficulty": "EASY"},
    
    {"id": "eda_quiz_3", "questionText": "In a dataset, a variable has a mean of 50 and a median of 30. What does this suggest about the distribution?", "type": "MCQ", "options": ["It is likely right-skewed (positively skewed)", "It is likely left-skewed (negatively skewed)", "It is likely normally distributed", "It contains no outliers"], "correctAnswer": "It is likely right-skewed (positively skewed)", "explanation": "When the mean is greater than the median, the distribution is typically right-skewed (positively skewed). This happens because the mean is pulled toward the tail of high values, while the median remains at the middle position.", "difficulty": "MEDIUM"},
    
    {"id": "eda_quiz_4", "questionText": "What is the primary purpose of a correlation matrix in EDA?", "type": "MCQ", "options": ["To identify relationships between pairs of variables", "To test for normality of distributions", "To detect outliers in the dataset", "To summarize categorical variables"], "correctAnswer": "To identify relationships between pairs of variables", "explanation": "A correlation matrix displays the correlation coefficients between multiple variables, allowing analysts to quickly identify which pairs of variables have strong, weak, positive, or negative relationships.", "difficulty": "MEDIUM"},
    
    {"id": "eda_quiz_5", "questionText": "Which measure is most useful for understanding the spread of a dataset that has significant outliers?", "type": "MCQ", "options": ["Interquartile range (IQR)", "Standard deviation", "Range", "Variance"], "correctAnswer": "Interquartile range (IQR)", "explanation": "The interquartile range (IQR), which measures the spread of the middle 50% of the data, is resistant to outliers because it doesn't depend on the extreme values. Standard deviation, variance, and range are all sensitive to outliers and can be misleading in their presence.", "difficulty": "HARD"}
  ]
}