{
  "topicId": "sql_transactions",
  "quizQuestions": [
    {"id": "sql_trans_quiz_1", "questionText": "What does the 'A' stand for in the ACID properties?", "type": "MCQ", "options": ["Atomicity", "Availability", "Authentication", "Accuracy"], "correctAnswer": "Atomicity", "explanation": "Atomicity ensures that a transaction is treated as a single, indivisible unit, which either completes entirely or not at all. It's the 'all or nothing' property of transactions.", "difficulty": "EASY"},
    
    {"id": "sql_trans_quiz_2", "questionText": "Which SQL command is used to start a transaction?", "type": "MCQ", "options": ["BEGIN TRANSACTION", "START TRANSACTION", "Both A and B are correct", "INIT TRANSACTION"], "correctAnswer": "Both A and B are correct", "explanation": "Different database systems use different syntax to start a transaction. BEGIN TRANSACTION is common in SQL Server, while START TRANSACTION is used in MySQL. Both are standard ways to initiate a transaction.", "difficulty": "EASY"},
    
    {"id": "sql_trans_quiz_3", "questionText": "Which transaction isolation level allows dirty reads but prevents lost updates?", "type": "MCQ", "options": ["READ UNCOMMITTED", "READ COMMITTED", "REPEATABLE READ", "SERIALIZABLE"], "correctAnswer": "READ UNCOMMITTED", "explanation": "READ UNCOMMITTED is the lowest isolation level. It allows transactions to read data that has been modified by other transactions but not yet committed (dirty reads), but it still prevents lost updates through basic locking mechanisms.", "difficulty": "HARD"},
    
    {"id": "sql_trans_quiz_4", "questionText": "What happens if a transaction is not explicitly committed or rolled back?", "type": "MCQ", "options": ["It's automatically rolled back", "It's automatically committed", "It depends on the database system", "The changes remain pending indefinitely"], "correctAnswer": "It depends on the database system", "explanation": "The behavior varies by database system. Some automatically commit (auto-commit mode), some roll back, and some might leave the transaction open until the session ends or times out. It's best practice to always explicitly end transactions.", "difficulty": "MEDIUM"},
    
    {"id": "sql_trans_quiz_5", "questionText": "What is a 'phantom read' in the context of transaction isolation?", "type": "MCQ", "options": ["When a transaction re-reads data and finds new rows that weren't there before", "When a transaction reads uncommitted data", "When a transaction reads data that was later rolled back", "When a transaction cannot find data it previously inserted"], "correctAnswer": "When a transaction re-reads data and finds new rows that weren't there before", "explanation": "A phantom read occurs when a transaction reads a set of rows that satisfy a search condition, then another transaction inserts new rows that also satisfy that condition, and the first transaction re-reads and sees these new 'phantom' rows.", "difficulty": "HARD"}
  ]
}